In [46]:
import pandas as pd
import numpy as np

In [48]:
df = pd.read_csv("training_titanic_x_y_train.csv")
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [49]:
X_train = df.iloc[:,:10] 
Y_train = df.iloc[:,-1:]

In [50]:
#preprocessing 
X_train['sex']=X_train['Sex'].map({"female":0, "male":1})
X_train.drop('Sex', axis=1, inplace=True)

X_train.loc[X_train['Embarked'].isnull(), 'Embarked']='S'
X_train['embarked']=X_train['Embarked'].map({"S":0, "C":0.5, "Q":1})
X_train.drop('Embarked', inplace=True, axis=1)

X_train.drop('Name', axis=1, inplace=True)

In [51]:
X_train['pclass']=X_train['Pclass']/3
X_train.drop('Pclass', axis=1, inplace=True)

In [52]:
X_train.drop('Ticket', axis=1, inplace=True)
X_train.drop('Cabin', axis=1, inplace=True)
X_train.head()

    Age  SibSp  Parch    Fare  sex  embarked    pclass
0  29.0      1      0  26.000    0       0.0  0.666667
1   NaN      0      0   8.050    1       0.0  1.000000
2  39.0      0      0  26.000    1       0.0  0.666667
3  29.0      0      4  21.075    0       0.0  1.000000
4  25.0      0      0   7.050    1       0.0  1.000000

In [55]:
X_train['Age'].fillna(int(X_train['Age'].mean()), inplace=True)
X_train.head()

    Age  SibSp  Parch    Fare  sex  embarked    pclass
0  29.0      1      0  26.000    0       0.0  0.666667
1  29.0      0      0   8.050    1       0.0  1.000000
2  39.0      0      0  26.000    1       0.0  0.666667
3  29.0      0      4  21.075    0       0.0  1.000000
4  25.0      0      0   7.050    1       0.0  1.000000

In [56]:
from sklearn.linear_model import LogisticRegression

In [61]:
alg = LogisticRegression(solver="saga", max_iter=200000, C=10, tol=0.000001, class_weight="balanced")

In [63]:
Y_train.shape

(668, 1)

In [62]:
alg.fit(X_train,Y_train)

C:\Users\shiva\anaconda3\lib\site-packages\sklearn\utils\validation.py:993: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression(C=10, class_weight='balanced', max_iter=200000,
                   solver='saga', tol=1e-06)

In [65]:
alg.score(X_train, Y_train)

0.7799401197604791

In [68]:
X_test = pd.read_csv('test_titanic_x_test.csv')
X_test['sex']=X_test['Sex'].map({"female":0, "male":1})
X_test.drop('Sex', axis=1, inplace=True)

X_test.loc[X_test['Embarked'].isnull(), 'Embarked']='S'
X_test['embarked']=X_test['Embarked'].map({"S":0, "C":0.5, "Q":1})
X_test.drop('Embarked', inplace=True, axis=1)

X_test.drop('Name', axis=1, inplace=True)

X_test['pclass']=X_test['Pclass']/3
X_test.drop('Pclass', axis=1, inplace=True)

X_test.drop('Ticket', axis=1, inplace=True)
X_test.drop('Cabin', axis=1, inplace=True)

X_test['Age'].fillna(int(X_test['Age'].mean()), inplace=True)
X_test.head()

    Age  SibSp  Parch     Fare  sex  embarked    pclass
0   8.0      1      1  36.7500    1       0.0  0.666667
1  49.0      0      0  25.9292    0       0.0  0.333333
2  29.0      0      0   7.7375    1       1.0  1.000000
3  24.0      2      1  27.0000    0       0.0  0.666667
4  36.0      0      0  26.2875    1       0.0  0.333333

In [70]:
y_pred = alg.predict(X_test)

In [71]:
np.savetxt(X=y_pred, delimiter=',', fname='predictions.csv', fmt='%.0f')